blog-posts/2004-12-02-web-site-design.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Web site design</title>
<!-- 2015-10-19 Mon 14:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Web site design</h1>
<p>
December 2nd, 2004 -
<a href="http://sachachua.com/blog/p/2455"><a href="http://sachachua.com/blog/p/2455">http://sachachua.com/blog/p/2455</a></a>
</p>

<p>
After seeing the quotation from the web design firm my mom's thinking
 of using, I have gotten sufficiently annoyed about the current design.
 I will apply my one-hour hacking challenge to
 <a href="http://www.adphoto.com.ph"><a href="http://www.adphoto.com.ph">http://www.adphoto.com.ph</a></a> tomorrow. That
is, in one hour, I will try
 to whiz through as many improvements as possible.
</p>

<p>
It's been enough time that I've forgotten what their design looked
 like. I'll sit down tomorrow and hack up something small and simple.
 Neat. No frills. Clean and elegant, though, and search-friendly. It
 won't get picked up by the search engines right away, but I'll see
 what I can do about that also.
</p>

<p>
If they think the design resembles theirs too much, I can modify it.
 &lt;shrug&gt; Still, better to have code I understand than autogen
 code I don't.
</p>

<p>
Some insights:
</p>

<ul class="org-ul">
<li>Websites can be tweaked over time, just like software. I can improve
</li>
</ul>

<blockquote>
<p>
it incrementally. I should think of it like planner.
</p>
</blockquote>

<ul class="org-ul">
<li>I wanted a professional design firm because I wanted a real
</li>
</ul>

<blockquote>
<p>
copywriter to go over the stuff. I don't want people to just
 copy-and-paste blocks of text from the company profile.
</p>
</blockquote>

<ul class="org-ul">
<li>I also wanted someone to do the initial implementation so that I can
</li>
</ul>

<blockquote>
<p>
just do maintenance, which I enjoy. If I'm sufficiently annoyed,
 though, I can just evolve the site. One of the most effective ways
 to get me to do something is to make me annoyed enough with the
 current situation.
</p>
</blockquote>

<ul class="org-ul">
<li>Design: As long as it isn't horrible, it's okay. People will visit
</li>
</ul>

<blockquote>
<p>
for photos and information, not for website design tips.
</p>
</blockquote>

<ul class="org-ul">
<li>Future: Stock photos CMS, delicious-style tagging. But not now.
</li>
</ul>

<blockquote>
<p>
Small hack forward.
</p>
</blockquote>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
